Repository: jcurl/RJCP.DLL.CommandLine
Catalog: code/Resources/CmdLineStrings.*.resx
Languages: de

# ArgException_InvalidCollection
source: Adding a value to an option that is not a collection
de: Hinzufügen eines Werts zu einer Option, die keine Sammlung ist

# ArgException_InvalidCollectionNoAdd
source: Collection identified without an Add method
de: Sammlung ohne Add-Methode identifiziert

# ArgException_InvalidTypeMultipleGenTypeParams
source: Expected only one Generic parameter type argument
de: Erwartet nur ein generisches Parametertypargument

# ArgException_InvalidTypeNoGeneric
source: Member must be a concrete type, not a generic type definition
de: Das Feld muss ein konkreter Typ sein, keine generische Typdefinition

# ArgException_NotPropertyOrField
source: Not a property or field
de: Keine Eigenschaft oder kein Feld

# ErrorParsingOption
source: Error parsing option '{0}'
de: Fehler beim Parsen der Option '{0}'

# ErrorParsingOptionFormat
source: Wrong format '{0}' given to option '{1}'
de: Falsches Format '{0}' für Option '{1}'

# InternalError_OptionIsAlreadySet
source: Internal Error: Setting an option to false, when it's already set
de: Interner Fehler: Setzen einer Option auf false, wenn diese bereits festgelegt ist

# ListInvalidData
source: Invalid data after quoted list, expect '{0}' only
de: Ungültige Daten nach der zitierten Liste, erwartet nur '{0}'

# ListMissingQuote
source: Missing quote in list
de: Fehlendes Anführungszeichen in Liste

# LongOptionInvalidChar
source: Long option has invalid character: '{0}'
de: Lange Option hat ungültiges Zeichen: '{0}'

source: Long Option may not be empty
de: Lange Option darf nicht leer sein

# OptionIncorrectFormat
source: Option '{0}' has incorrect format
de: Option '{0}' hat ein ungültiges Format

# OptionMissingArgument
source: Option '{0}' missing argument
de: Option '{0}' fehlendes Argument

# OptionMissingOption
source: Option '{0}' expected but not provided
de: Option '{0}' erwartet, aber nicht angegeben

# OptionMultipleTimes
source: Option '{0}' provided multiple times
de: Option '{0}' mehrfach bereitgestellt

# OptionsStyleUnknown
source: Unknown Options Style
de: Unbekannter Optionstyp

# OptionUnknown
source: Option '{0}' not recognized
de: Option '{0}' nicht erkannt

# ShortOptionInvalidChar
source: Short option '{0}' character not allowed
de: Kurze Option '{0}' Zeichen nicht erlaubt

# UnexpectedOptionNonZeroGeneralArgs
source: Unexpected option '{0}'
de: Unerwartete Option '{0}'

# UnexpectedOptionNonZeroGeneralArgsLastToken
source: Unexpected option '{0}' found, perhaps too many arguments after '{1}'
de: Unerwartete Option '{0}' gefunden, möglicherweise zu viele Argumente nach '{1}'

# UnexpectedValueForOption
source: Unexpected value for option '{0}'
de: Unerwarteter Wert für Option '{0}'

# UnexpectedValueForOptionLastToken
source: Unexpected value for option '{0}' (argument '{1}')
de: Unerwarteter Wert für Option '{0}' (Argument '{1}')

# UnixCmdLineToken
source: Command line option {0} invalid, key value pairs must be isolated
de: Befehlszeiloption {0} ungültig, Schlüsselwertpaare müssen isoliert werden

# ArgException_ReadOnlyField
source: Cannot set a readonly field '{0}'
de: Das schreibgeschützte Feld '{0}' kann nicht festgelegt werden

# ArgException_NotSettableProperty
source: Cannot set a non-writable property '{0}'
de: Die schreibgeschützte Eigenschaft '{0}' kann nicht gesetzt werden

# ArgException_FieldNotPrimitive
source: Field '{0}' must be a primitive type
de: Feld '{0}' muss ein primitiver Typ sein

# ArgException_PropertyNotPrimitive
source: Property '{0}' must be a primitive type
de: Eigenschaft '{0}' muss ein primitiver Typ sein

# ArgException_CollectionNotPrimitive
source: Collection '{0}' must contain a primitive type
de: Sammlung '{0}' muss ein primitiver Typ sein
